# Data Cleaner Tool - Mini Project

This notebook guides you through building a simple data cleaner using pandas.

In [1]:
import pandas as pd

# Load your data
input_file = 'sample_data.csv'
df = pd.read_csv(input_file)
display(df)

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35     New York   90000
3    David   28      Chicago   75000
4      Eva   22  Los Angeles   68000

## 1. Remove Duplicates

In [2]:
df = df.drop_duplicates()
display(df)

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35     New York   90000
3    David   28      Chicago   75000
4      Eva   22  Los Angeles   68000

## 2. Handle Missing Values
- Option 1: Drop rows with missing values
- Option 2: Fill missing values (e.g., with 0 or 'Unknown')

In [3]:
# Uncomment one of the following lines as needed:
# df = df.dropna()
# df = df.fillna(0)
# df = df.fillna('Unknown')
display(df)

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35     New York   90000
3    David   28      Chicago   75000
4      Eva   22  Los Angeles   68000

## 3. Save Cleaned Data

In [4]:
output_file = 'cleaned_data.csv'
df.to_csv(output_file, index=False)
print(f'Cleaned data saved to {output_file}')

Cleaned data saved to cleaned_data.csv